# -*- coding: utf-8 -*-
"""
Created on Thu May  9 14:30:05 2024

@author: soyoung
"""

#%%
#노면상태 (건조, 기타, 서리/결빙, 적설, 젖음/습기)

#습도
"""
건조: 10% 미만
약간 젖음: 10% ~ 30%
적당히 젖음: 30% ~ 60%
매우 젖음: 60% 이상 """

#온도
"""
영하 2°C 이하: 노면이 결빙되어 미끄러울 가능성이 높음.                   
영하 2°C ~ 4°C: 노면이 간헐적으로 결빙될 수 있으며, 주의가 필요함.
4°C ~ 10°C: 노면이 습할 가능성이 높음.
10°C 이상: 노면이 건조할 가능성이 높음 """


#풍속
"""
풍속 10m/s 이상: 차량 운전에 어려움을 겪을 수 있으며, 교통 사고 위험 증가.
풍속 15m/s 이상: 강풍으로 인해 도로 위의 물체가 날아다닐 수 있음.
풍속 20m/s 이상: 매우 강한 바람으로 인해 차량 운전 매우 위험. """

#강수량
"""
눈 5cm 이상: 도로가 미끄러울 가능성 높음이며, 특히 언덕이나 구불구불한 도로에서는 더욱 위험.
비 20mm 이상: 도로가 젖어 미끄러울 가능성 높음이며, 시야 저하로 인해 운전에 어려움 겪을 수 있음 """



